<?php
return [

    'required' => 'حقل :attribute مطلوب.',
    'email' => 'يجب أن يكون :attribute عنوان بريد إلكتروني صالح.',
    'exists' => 'ال:attribute المحدد غير صالح.',
    'password' => [
        'required' => 'حقل كلمة المرور مطلوب.',
        'string' => 'يجب أن تكون كلمة المرور نصًا.',
        'confirmed' => 'تأكيد كلمة المرور غير متطابق.',
        'min' => [
            'string' => 'يجب أن تحتوي كلمة المرور على على الأقل :min أحرف.',
        ],
    ],

    'password_confirmation' => [
        'required' => 'حقل تأكيد كلمة المرور مطلوب.',
        'same' => 'حقل تأكيد كلمة المرور يجب أن يطابق حقل كلمة المرور.',
    ],

    'unique' => 'ال:attribute مُستخدم بالفعل.',

    'attributes' => [
        'name' => 'الاسم',
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
    ],

    'client' => [
        'email.unique' => 'البريد الإلكتروني مستخدم بالفعل في حساب عميل آخر.',
    ],

    'success' => 'تم بنجاح',
    'error' => 'حدث خطأ',
];
